## Libraries

In [1]:
# pandas = Pandas is used for data manipulation, analysis and cleaning.
# Numy   = scientific computing and data manipulation in Python
# Scikit learn = Machine learning Models
# Matplot = Data visualization

In [2]:
# Pandas

In [3]:
import pandas as pd

In [4]:
# Directory  is a collection of files and sub directories
dir(pd)

['Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Float64Index',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int64Index',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseArray',
 'SparseDataFrame',
 'SparseDtype',
 'SparseSeries',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt64Index',
 'UInt8Dtype',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__getattr__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_config',
 '_hashtable',
 '_lib',
 '_libs',
 '_np_version_under1p14',
 '_np_version_under1p15',
 '_np_version_under1p16',
 '_np_version_under1p17',
 '_tslib',
 '_typing',
 '_version',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'datetime',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'np',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_msgpack',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_msgpack',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

### 1. How to  creat a  series  of Data


### 2. What is Dictionary

Dictionary in Python is a collection of data values, used to store data values like a map, which unlike other Data Types that hold only single value as an element, Dictionary holds "key:value pair". Key value is provided in the dictionary to make it more optimized.

### 3. How to  Creat Dictionary

Dictionary can be created by placing sequence of elements within curly {} braces, separated by 'comma'. 
Dictionary holds a pair of values, one being the Key and the other corresponding pair element being its Key:value.

D =  variable  
key = Correspond to the table Headers of Data (apple,orange,etc,..)   
values  = listscorresponding to the rows.

In [5]:
# SAMPLE

In [6]:
D = {
    'Apple':[0,2,3,4,5],
    'Orange':[1,2,8,4,5]         
}

In [7]:
# WITHOUT DATAFRAME
D

{'Apple': [0, 2, 3, 4, 5], 'Orange': [1, 2, 8, 4, 5]}

In [8]:
# Dataframe 

pd.DataFrame(D)

   Apple  Orange
0      0       1
1      2       2
2      3       8
3      4       4
4      5       5

### EXAMPLE

In [9]:
# Creating DATAFRAME 
# In  the below example ("ITEMS","PER KG","@  KGS") are  KEY and PRICES are values
df = {
    "ITEMS": ["APPLE","ORANGE","GRAPES","BANANA","MANGO"],
    "per kg":["RS.200","RS.150","RS.250","RS.100","RS.120"],
    "2 kgs":["RS.400","RS.300","RS.500","RS.200","RS.240"]
}

In [10]:
# READING DATAFRAME

df = pd.DataFrame(df)

In [11]:
df

    ITEMS  per kg   2 kgs
0   APPLE  RS.200  RS.400
1  ORANGE  RS.150  RS.300
2  GRAPES  RS.250  RS.500
3  BANANA  RS.100  RS.200
4   MANGO  RS.120  RS.240

In [12]:
# CREATING CSV FILE

df.to_csv("/home/saiviswas/Documents/FRUITS.csv")

In [13]:
# Please check the selected path for CSV file and load the data as ("pd.read_csv")

In [14]:
# READ CSV FILE 

data = pd.read_csv("/home/saiviswas/Documents/FRUITS.csv",index_col = 0)

In [15]:
# READ DATA

data

    ITEMS  per kg   2 kgs
0   APPLE  RS.200  RS.400
1  ORANGE  RS.150  RS.300
2  GRAPES  RS.250  RS.500
3  BANANA  RS.100  RS.200
4   MANGO  RS.120  RS.240

In [16]:
# RENAMING THE 'ITEMS' to 'FRUITS-NAMES'.

DF = data.rename(columns= {'ITEMS':'FRUITS-NAME'})

In [17]:
DF

  FRUITS-NAME  per kg   2 kgs
0       APPLE  RS.200  RS.400
1      ORANGE  RS.150  RS.300
2      GRAPES  RS.250  RS.500
3      BANANA  RS.100  RS.200
4       MANGO  RS.120  RS.240

In [18]:
#  NEW DATAFRAME 

data1 = pd.DataFrame({"FRUITS-NAME":["PINEAPPELE","WATERMELON"],
                    "per kg":["RS.100","RS.150"],
                    "2 kgs":["RS.200","RS.300"]},index = [5,6])

In [19]:
data1

  FRUITS-NAME  per kg   2 kgs
5  PINEAPPELE  RS.100  RS.200
6  WATERMELON  RS.150  RS.300

In [20]:
#DISPLAY FUNCTION IS  USED TO DISPLAY DATAFRAME 

display(DF,data1)

  FRUITS-NAME  per kg   2 kgs
0       APPLE  RS.200  RS.400
1      ORANGE  RS.150  RS.300
2      GRAPES  RS.250  RS.500
3      BANANA  RS.100  RS.200
4       MANGO  RS.120  RS.240

  FRUITS-NAME  per kg   2 kgs
5  PINEAPPELE  RS.100  RS.200
6  WATERMELON  RS.150  RS.300

In [21]:
# MERGE THE DATAFRAME

In [22]:
DF1 = [DF,data1]

In [23]:
RESULT = pd.concat(DF1)

In [24]:
RESULT

  FRUITS-NAME  per kg   2 kgs
0       APPLE  RS.200  RS.400
1      ORANGE  RS.150  RS.300
2      GRAPES  RS.250  RS.500
3      BANANA  RS.100  RS.200
4       MANGO  RS.120  RS.240
5  PINEAPPELE  RS.100  RS.200
6  WATERMELON  RS.150  RS.300

In [25]:
# AS BOTH ARE DIFFERENT DATAFRAMES

pd.merge(DF,data1,on='FRUITS-NAME',how = "outer")

  FRUITS-NAME per kg_x 2 kgs_x per kg_y 2 kgs_y
0       APPLE   RS.200  RS.400      NaN     NaN
1      ORANGE   RS.150  RS.300      NaN     NaN
2      GRAPES   RS.250  RS.500      NaN     NaN
3      BANANA   RS.100  RS.200      NaN     NaN
4       MANGO   RS.120  RS.240      NaN     NaN
5  PINEAPPELE      NaN     NaN   RS.100  RS.200
6  WATERMELON      NaN     NaN   RS.150  RS.300